Repository: keinstein/rtmidi
Catalog: po/*.po
Languages: de

source: No data in message argument.
de: Keine Daten in der MIDI-Nachricht.

source: Passed NULL pointer.
de: Nullzeiger übergeben.

source: A NULL pointer has been passed as port descriptor
de: Ein leerer Zeiger wurde als Schnittstellenbeschreibung übergeben

source: No valid MIDI system has been selected.
de: Es wurde kein benutzbares MIDI-System ausgewählt.

source: No data in MIDI message.
de: Keine Daten in der MIDI-Nachricht.

source: The callback function value is invalid.
de: Der Funktionswert einer aufgerufenen Rückruffunktion ist ungültig.

source: Automatic backend selection
de: Automatische MIDI-System-Auswahl

source: Dummy/NULL device
de: Dummy/NULL-Gerät

source: All available MIDI systems
de: Alle verfügbaren MIDI-Systeme

source: Internal error: Could not lock the mutex.
de: Interner Fehler: Konnte den Mutex nicht reservieren.

source: No valid MIDI interfaces. I'm using a dummy input interface that never receives anything.
de: Keine gültige MIDI-Schnittstelle gefunden. Ich imitiere ein Eingabegerät, das niemals etwas empfängt.

source: No valid MIDI interfaces. I'm using a dummy output interface that does nothing.
de: Keine gültige MIDI-Schnittstelle gefunden. Ich imitiere ein Ausgabegerät, das nichts tut.

source: Could not get the unique identifier of a midi endpoint.
de: Konnte die eindeutige Identifikation (UUID) eines MIDI-Endpunktes nicht bekommen.

source: Could not get the endpoint back from the unique identifier of a midi endpoint.
de: Konnte den MIDI-Endpunkt einer eindeutige Identifikation (UUID) nicht bekommen.

source: Could not get the entity of a midi endpoint.
de: Konnte die Geräteeinheit eines MIDI-Endpunktes nicht bekommen.

source: Error creating OS X MIDI port because of invalid port flags.
de: Konnte die OS X-MIDI-Schnittstelle nicht anlegen, da ungültige Eigenschaften angegeben wurden.

source: Error creating OS-X MIDI port.
de: Es gab einen Fehler beim Erzeugen der MIDI-Schnittstelle.

source: Error creating OS-X MIDI client object ( Error no: %d ).
de: Fehler beim Erzeugen des OS-X-MIDI-Klienten (Fehlernummer: %d).

source: Error: Message queue limit reached.
de: Fehler: Die Nachrichten-Warteschlange ist überlang.

source: A valid connection already exists.
de: Es existiert schon eine gültige Verbindung.

source: No MIDI input sources found.
de: Keine MIDI-Eingabe-Geräte gefunden.

source: The 'portNumber' argument ( %d ) is invalid.
de: Die Portnummer %d ist ungültig.

source: Error creating OS-X MIDI input port.
de: Fehler beim Erzeugen der OS-X-MIDI-Eingabe-Schnittstelle.

source: Error getting MIDI input source reference.
de: Konnte keine Referenz zum MIDI-Eingang bekommen.

source: Error connecting OS-X MIDI input port.
de: Fehler beim verbinden mit dem OS-X-MIDI-Eingang.

source: Error creating virtual OS-X MIDI destination.
de: Konnte den virtuellen OS-X-MIDI-Ausgang nicht erzeugen.

source: Data has not been allocated.
de: Daten konnten nicht angelegt werden.

source: Core MIDI has been instructed to open a non-Core MIDI port. This doesn't work.
de: Core-MIDI wurde angewiesen, eine nicht-Core-MIDI-Schnittstelle zu öffnen. Das geht nicht.

source: Setting client names is not implemented for Mac OS X CoreMIDI.
de: Das Ändern des Namens des MIDI-Klienten ist für Mac OS X CoreMIDI nicht implementiert.

source: Setting port names is not implemented for Mac OS X CoreMIDI.
de: Das Ändern des Namens einer MIDI-Schnittstelle ist für Mac OS X CoreMIDI nicht implementiert.

source: No MIDI output destinations found.
de: Es wurden keine MIDI-Ausgabegeräte gefunden.

source: Error creating OS-X MIDI output port.
de: Fehler beim Erzeugen der OS-X-MIDI-Ausgabe-Schnittstelle.

source: Error getting MIDI output destination reference.
de: Konnte keine Referenz zum MIDI-Ausgang bekommen.

source: A virtual output port already exists.
de: Es gibt schon einen virtuellen MIDI-Ausgang.

source: Error creating OS-X virtual MIDI source.
de: Konnte den virtuellen OS-X-MIDI-Eingang nicht erzeugen.

source: message format problem ... not sysex but > 3 bytes?
de: Nachrichtenformatproblem: Eine MIDI-Nachricht ist größer als 3 Bytes … und keine SysEx-Nachricht?

source: Could not allocate packet list.
de: Konnte die Paketliste nicht anlegen.

source: Error sending MIDI to virtual destinations.
de: Konnte MIDI-Daten nicht zu virtuellen Ausgängen senden.

source: Error sending MIDI message to port.
de: Fehler beim Senden der MIDI-Nachricht zum Ausgang.

source: Could not allocate ALSA port info structure.
de: Konnte keinen Speicher für die ALSA-MIDI-Schnittstelleninformation bekommen.

source: Could not get ALSA port information: %s
de: Konnte keine ALSA-Schnittstelleninformation bekommen: %s

source: Could not set ALSA port information: %s
de: Konnte ALSA-Schnittstelleninformation nicht ändern: %s

source: Could not allocate ALSA port subscription.
de: Konnte keinen Speicher für das Abonnoment der ALSA-MIDI-Schnittstelle bekommen.

source: Error making ALSA port connection.
de: Konnte zwei ALSA-Schnittstellen nicht miteinander verbinden.

source: Error starting MIDI input thread.
de: Konnte den MIDI-Eingabe-Prozess nicht starten.

source: Error initializing MIDI event parser.
de: Fehler bei der Initialisierung des MIDI-Ereeignisparsers.

source: MIDI input buffer overrun.
de: MIDI-Eingabepuffer übergelaufen.

source: ALSA returned without providing a MIDI event.
de: ALSA kam zurück ohne ein MIDI-Ereignis mitzubringen.

source: Unknown MIDI input error. The system reports: %s
de: Unbekannter MIDI-Eingabefehler. Das System meldet: %s

source: Error resizing buffer memory.
de: Fehler beim Ändern der Grüße des Pufferspeichers.

source: Error creating pipe objects.
de: Fehler beim anlegen einer Pipe.

source: Event parsing error or not a MIDI event.
de: Analyse eines Ereignisses fehlgeschlagen oder es war kein MIDI-Ereignis.

source: Error looking for port name.
de: Fehler beim Suchen nach einem Schnittstellennamen.

source: Error creating ALSA input port.
de: Fehler beim Erzeugen der ALSA-Eingabe-Schnittstelle.

source: ALSA has been instructed to open a non-ALSA MIDI port. This doesn't work.
de: ALSA wurde angewiesen, eine nicht-ALSA-MIDI-Schnittstelle zu öffnen. Das geht nicht.

source: Error creating ALSA virtual port.
de: Fehler beim Erzeugen einer virtuellen ALSA-Schnittstelle.

source: Error creating ALSA sequencer client object.
de: Fehler beim erzeugen des ALSA-Klienten.

source: No MIDI output sinks found.
de: Es wurden kiene Midi-Ausgabegeräte gefunden.

source: Error creating ALSA output port.
de: Fehler beim Erzeugen der ALSA-Ausgangs.

source: ALSA error resizing MIDI event buffer.
de: ALSA-Fehler beim Verändern der Größe des MIDI-Nachrichten-Puffers.

source: ALSA consumed more bytes than availlable.
de: ALSA verbrauchte mehr Bytes als vorhanden sind.

source: Error allocating ALSA port subscription.
de: Konnte keinen Speicher für das Abonnoment der ALSA-MIDI-Schnittstelle bekommen.

source: The port argument %d is invalid.
de: Das Schnittstellenargument %d ist ungültig.

source: Error sending sysex to Midi device.
de: Fehler beim Senden der SysEx-Nachricht zum MIDI-Gerät.

source: No MIDI input devices currently available.
de: Es gibt momentan keine MIDI-Eingabegeräte.

source: Failed to initialize a critical section.
de: Konnte kritischen Bereich nicht initialisieren.

source: the 'portNumber' argument ( %d ) is invalid.
de: Die Portnummer %d ist ungültig.

source: Error creating Windows MM MIDI input port.
de: Konnte den Windows-Multimedia-MIDI-Eingang nicht erzeugen.

source: Error initializing data for Windows MM MIDI input port.
de: Fehler beim Erzeugen der daten für einen Windows Multimedia MIDI-Eingang.

source: Could not register the input buffer for Windows MM MIDI input port.
de: Konnte den Eingabe-Puffer eines Windows-Multimedia-MIDI-Eingangs nicht erzeugen.

source: Error starting Windows MM MIDI input port.
de: Konnte einen Windows-Multimedia-MIDI-Eingang nicht aktivieren.

source: Virtual ports are not available Windows Multimedia MIDI API.
de: Windows Multimedia unterstützt keine virtuellen MIDI-Ein- und -Ausgänge.

source: Windows Multimedia ( WinMM ) has been instructed to open a non-WinMM MIDI port. This doesn't work.
de: Windows Multimedia (WinMM) wurde angewiesen, eine nicht-WinMM-MIDI-Schnittstelle zu öffnen. Das geht nicht.

source: We are overwriting an existing connection. This is probably a programming error.
de: Wir überschreiben eine vorhandene MIDI-Verbindung. Das ist vermutlich ein Programmierfehler.

source: Trying to open a non-input port as input MIDI port. This doesn't work.
de: Versuche eine Nicht-Eingang als MIDI-Eingang zu öffnen. Das geht nicht.

source: Some change in the arrangement of MIDI input ports invalidated the port descriptor.
de: Eine Veränderung bei den MIDI-Schnittstellen hat die interne Schnittstellenbeschreibung ungültig gemacht.

source: The handle is invalid. Did you disconnect the device?
de: Ein Schnittstellenverweis ist ungültig. Haben Sie das zugehörige Gerät entfernt?

source: The system has no driver for our handle :-( . Did you disconnect the device?
de: Das System hat keinen Treiber für unseren Schnittstellenverweis (mehr) :-(. Haben Sie das zugehörige Gerät entfernt?

source: Out of memory.
de: Hauptspeicher erschöpft.

source: Error closing Windows MM MIDI input port.
de: Konnte den Windows Multimedia MIDI-Eingang nicht ordnungsgemäß schließen.

source: Setting the client name is not supported by Windows MM.
de: Das Ändern des Namens des MIDI-Klienten wird vom Windows MIDI Mapper nicht unterstützt.

source: Setting the port name is not supported by Windows MM.
de: Das Ändern des Namens der MIDI-Schnittstelle wird vom Windows MIDI Mapper nicht unterstützt.

source: No MIDI output devices currently available.
de: Es gibt momentan keine MIDI-Ausgabegeräte.

source: Error creating Windows MM MIDI output port.
de: Konnte den Windows Multimedia MIDI-Ausgang nicht erzeugen.

source: The port descriptor cannot be used to open an output port.
de: Eine Schnittstellenbeschreibung kann nicht benutzt werden, um einen MIDI-Ausgang zu erzeugen.

source: The internal handle is invalid. Did you disconnect the device?
de: Ein interner Schnittstellenverweis ist ungültig. Haben sie das zugehörige Gerät entfernt?

source: Message argument is empty.
de: Das Nachrichtenargument ist leer.

source: Error while allocating sysex message memory.
de: Fehler beim Anlegen des Speichers für SysEx-Nachrichten.

source: Error preparing sysex header.
de: Fehler beim Erstellen des SysEx-Kopfes.

source: Error sending sysex message.
de: Fehler beim Senden der SysEx-Nachricht.

source: Message size is greater than 3 bytes ( and not sysex ).
de: Eine MIDI-Nachricht ist größer als 3 Bytes (und keine SysEx-Nachricht).

source: Error sending MIDI message.
de: Fehler beim Senden der MIDI-Nachricht.

source: Could not initialise the JACK client mutex
de: Ich konnte den JACK-Client-Mutex nicht initialisieren

source: Could not connect to JACK server. Is it runnig?
de: Ich konnte mich nicht mit dem JACK-Server verbinden. Läuft er?

source: Invalid port submitted to JackPortDescriptor( ).
de: Ungültige Schnitstelle zu JackPortDescriptor() übergeben.

source: No ports available.
de: Keine Schnittstellen verfügbar.

source: Error opening JACK port subscription.
de: Fehler beim abonnieren einer JACK-Schnittstelle.

source: JACK server not running?
de: Läuft der JACK-Server?

source: Missing JACK MIDI data object.
de: Fehlendes JACK-MIDI-Datenobjekt.

source: JACK has been instructed to open a non-JACK MIDI port. This doesn't work.
de: JACK wurde angewiesen, eine nicht-JACK-Schnittstelle zu öffnen. Das geht nicht.

source: Setting the client name is not supported by JACK.
de: Das Ändern des Namens des MIDI-Klienten wird von JACK nicht unterstützt.

source: Cannot allocate JACK MIDI data object.
de: Konnte das JACK-MIDI-Datenobjekt nicht anlegen.

source: Error formatting the error string: '%s' Found in %s::%s at %s:%d
de: Fehler bei der Formatierung der Fehlermeldung: '%s' gefunden in %s::%s bei %s:%d

source: Error: Could not format the error message.
de: Fehler: Ich konnte eine Fehlermeldung nicht formatieren.

source: No supported MIDI system has been found.
de: Es konnte kein benutzbares MIDI-System gefunden werden.

source: Support for the selected MIDI system %d has not been compiled into the RtMidi library.
de: Die Unterstützung für das gewählte MIDI-System %d wurde nicht in die RtMidi-Bibliothek eingebaut.

source: A callback function is already set.
de: Es wurde schon eine Rückruffunktion gesetzt.

source: No callback function was set.
de: Es wurde keine Rückruffunktion gesetzt.

source: Returning an empty MIDI message as all input is handled by a callback function.
de: Es wird eine leere MIDI-Nachricht generiert, weil alle Eingaben durch eine Rückruf-Funktion (engl. callback) abgefangen werden.

source: ALSA MIDI input buffer overrun.
de: ALSA-MIDI-Eingabepuffer übergelaufen.

source: Unknown ALSA MIDI input error. The system reports: %s
de: Unbekannter MIDI-Eingabefehler. Das System meldet: %s

source: Received an ALSA event with an invalid port number (%d).
de: Es wurde ein ALSA-Ereignis mit ungültier Portnummer (%d) empfangen.

source: Error creating ALSA port.
de: Fehler beim Erzeugen der ALSA-Schnittstelle.

source: Error creating ALSA MIDI pipe objects.
de: Fehler beim anlegen einer ALSA-MIDI-Pipe.

source: Error initializing ALSA MIDI event parser.
de: Fehler bei der Initialisierung des ALSA-MIDI-Ereignisparsers.

source: Error sending ALSA MIDI message with negative length %d.
de: Fehler beim Senden der ALSA-MIDI-Nachricht mit negativer Länge %d.

source: Error sending ALSA MIDI message to port. Error %d: %s
de: Fehler beim Senden der MIDI-Nachricht zum Ausgang. Fehler %d: %s

source: Error starting ALSA MIDI input thread.
de: Konnte den MIDI-Eingabe-Prozess nicht starten.

source: ALSA input port has algready been connected.
de: Die ALSA-Schnittstelle wurde schon verbunden.

source: ALSA output port has algready been connected.
de: Der MIDI-Ausgang wurde schon verbunden.

source: Tying to initialize null pointer as ALSA MIDI event parser.
de: Versuchte einen Nullzeiger als MIDI-Ereeignisparser zu initialisieren.

source: Event parsing error or not an ALSA MIDI event.
de: Analyse eines Ereignisses fehlgeschlagen oder es war kein MIDI-Ereignis.
